public class NationKorea{
/*
여러줄의 주석을 입력하는 영역

클래스와 파일이름 이름짓기(명령규칙)
무조건 첫글자는 대문자

가급적 2개 이상의 단어를 조합하여 이름을 짓자
사전(DIC)에 있는 단어들을 1개만 사용할 경우
java에 기본적으로 있는 Key word 와 겹쳐서
문제를 일으키기도 한다.
그러한 문제를 피하기위해 사전에 있는 단어를
사용하고자 하면 2개 이상의 단어를 조합하는 것이 좋다

단어 2개 이상을 조합하여 사용할 경우
첫글자는 무조건 대문자
이후 시작되는 단어 첫글자도 대문자를 사용
또는 중간에 under bar, under score(_)를 넣어서 사용하기도 한다.

NationKorea = 두단어 시작 대문자사용 (Camel Case 명명법)
Nation_Korea = 두단어 사이에 언더바 _ 를 사용 (Snake case 명명법)
Nation Korea : 단어 중간에 빈칸, 특수문자 등 사용 금지
Nation1, Nation_1 : 숫자등을 조합하여 사용가능
1Nation : 숫자로 시작은 금지
 

*/
}